---
kind: type
id: T:Autodesk.Revit.DB.RoutingPreferenceManager
source: html/a8300b97-72a6-beb5-733b-ec4cfea6c472.htm
---
# Autodesk.Revit.DB.RoutingPreferenceManager

Manages default pipe segments, fittings, and selection criteria for a given MEPCurveType

## Syntax (C#)
```csharp
public class RoutingPreferenceManager : IDisposable
```

## Remarks
MEPCurveTypes contain a RoutingPreferenceManager property.
 The RoutingPreferenceManager contains rules for selecting segment types and sizes as well as fitting types based on user selection criteria.